cc-ex-01/disk_benchmark/tests/openstack /fio_stats.txt
=========== Test time: Sat Jun 17 14:14:49 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25609: Sat Jun 17 14:14:56 2017
  read : io=256348KB, bw=45403KB/s, iops=11350, runt=  5646msec
    slat (usec): min=1, max=209, avg= 3.43, stdev= 2.61
    clat (usec): min=6, max=123176, avg=47.63, stdev=1563.83
     lat (usec): min=7, max=123181, avg=51.06, stdev=1563.83
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   11], 95.00th=[   16],
     | 99.00th=[   55], 99.50th=[  502], 99.90th=[ 3504], 99.95th=[14400],
     | 99.99th=[103936]
    bw (KB  /s): min=40805, max=49912, per=99.65%, avg=45245.00, stdev=3282.07
  write: io=255652KB, bw=45280KB/s, iops=11320, runt=  5646msec
    slat (usec): min=1, max=183, avg= 3.51, stdev= 2.42
    clat (usec): min=8, max=155097, avg=29.47, stdev=1146.88
     lat (usec): min=10, max=155099, avg=32.98, stdev=1146.87
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   11],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   15],
     | 99.00th=[   29], 99.50th=[   50], 99.90th=[ 1640], 99.95th=[ 2160],
     | 99.99th=[48384]
    bw (KB  /s): min=41115, max=49934, per=99.45%, avg=45029.70, stdev=3177.24
    lat (usec) : 10=48.12%, 20=49.22%, 50=1.76%, 100=0.25%, 250=0.10%
    lat (usec) : 500=0.13%, 750=0.14%, 1000=0.08%
    lat (msec) : 2=0.12%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.03%, sys=9.38%, ctx=321963, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45403KB/s, minb=45403KB/s, maxb=45403KB/s, mint=5646msec, maxt=5646msec
  WRITE: io=255652KB, aggrb=45280KB/s, minb=45280KB/s, maxb=45280KB/s, mint=5646msec, maxt=5646msec

Disk stats (read/write):
  vda: ios=926/393, merge=0/12, ticks=7456/43288, in_queue=50756, util=91.67%
$

=========== Test time: Sat Jun 17 14:27:11 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25707: Sat Jun 17 14:27:18 2017
  read : io=256348KB, bw=45533KB/s, iops=11383, runt=  5630msec
    slat (usec): min=1, max=793, avg= 3.39, stdev= 3.80
    clat (usec): min=6, max=171695, avg=50.87, stdev=1712.49
     lat (usec): min=8, max=171697, avg=54.26, stdev=1712.51
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  482], 99.90th=[ 6112], 99.95th=[16768],
     | 99.99th=[109056]
    bw (KB  /s): min=41290, max=49996, per=99.62%, avg=45357.30, stdev=2985.15
  write: io=255652KB, bw=45409KB/s, iops=11352, runt=  5630msec
    slat (usec): min=1, max=288, avg= 3.47, stdev= 2.38
    clat (usec): min=8, max=115617, avg=26.16, stdev=874.81
     lat (usec): min=10, max=115621, avg=29.64, stdev=874.81
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[   10], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   23], 99.50th=[   37], 99.90th=[ 1576], 99.95th=[ 2096],
     | 99.99th=[31616]
    bw (KB  /s): min=41663, max=50104, per=99.41%, avg=45142.00, stdev=2987.55
    lat (usec) : 10=47.31%, 20=50.99%, 50=0.84%, 100=0.22%, 250=0.09%
    lat (usec) : 500=0.13%, 750=0.15%, 1000=0.07%
    lat (msec) : 2=0.11%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.48%, sys=8.56%, ctx=317350, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45532KB/s, minb=45532KB/s, maxb=45532KB/s, mint=5630msec, maxt=5630msec
  WRITE: io=255652KB, aggrb=45408KB/s, minb=45408KB/s, maxb=45408KB/s, mint=5630msec, maxt=5630msec

Disk stats (read/write):
  vda: ios=931/417, merge=0/13, ticks=7672/46300, in_queue=54040, util=91.97%
$

=========== Test time: Sat Jun 17 14:27:30 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25720: Sat Jun 17 14:27:37 2017
  read : io=256348KB, bw=45291KB/s, iops=11322, runt=  5660msec
    slat (usec): min=1, max=250, avg= 3.34, stdev= 2.42
    clat (usec): min=6, max=192138, avg=47.52, stdev=1627.77
     lat (usec): min=7, max=192143, avg=50.86, stdev=1627.78
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   57], 99.50th=[  506], 99.90th=[ 3472], 99.95th=[16768],
     | 99.99th=[93696]
    bw (KB  /s): min=37079, max=50592, per=100.00%, avg=45570.70, stdev=3653.57
  write: io=255652KB, bw=45168KB/s, iops=11292, runt=  5660msec
    slat (usec): min=1, max=183, avg= 3.45, stdev= 2.32
    clat (usec): min=8, max=119737, avg=30.15, stdev=1050.42
     lat (usec): min=10, max=119741, avg=33.59, stdev=1050.42
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   41], 99.90th=[ 1672], 99.95th=[ 2352],
     | 99.99th=[57600]
    bw (KB  /s): min=37706, max=48830, per=100.00%, avg=45388.80, stdev=3247.34
    lat (usec) : 10=49.87%, 20=48.43%, 50=0.83%, 100=0.22%, 250=0.09%
    lat (usec) : 500=0.13%, 750=0.14%, 1000=0.08%
    lat (msec) : 2=0.13%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.36%, sys=8.37%, ctx=307305, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45291KB/s, minb=45291KB/s, maxb=45291KB/s, mint=5660msec, maxt=5660msec
  WRITE: io=255652KB, aggrb=45168KB/s, minb=45168KB/s, maxb=45168KB/s, mint=5660msec, maxt=5660msec

Disk stats (read/write):
  vda: ios=923/397, merge=0/6, ticks=7552/44228, in_queue=51784, util=92.17%
$

=========== Test time: Sat Jun 17 14:28:02 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25733: Sat Jun 17 14:28:08 2017
  read : io=256348KB, bw=45654KB/s, iops=11413, runt=  5615msec
    slat (usec): min=1, max=223, avg= 3.45, stdev= 2.10
    clat (usec): min=6, max=138159, avg=49.00, stdev=1671.86
     lat (usec): min=7, max=138161, avg=52.45, stdev=1671.88
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  470], 99.90th=[ 2832], 99.95th=[16512],
     | 99.99th=[109056]
    bw (KB  /s): min=41900, max=51424, per=100.00%, avg=46023.60, stdev=3269.83
  write: io=255652KB, bw=45530KB/s, iops=11382, runt=  5615msec
    slat (usec): min=1, max=325, avg= 3.55, stdev= 2.39
    clat (usec): min=8, max=119252, avg=27.71, stdev=976.27
     lat (usec): min=10, max=119256, avg=31.26, stdev=976.28
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   22], 99.50th=[   32], 99.90th=[ 1560], 99.95th=[ 2480],
     | 99.99th=[47872]
    bw (KB  /s): min=41919, max=51072, per=100.00%, avg=45819.30, stdev=2955.56
    lat (usec) : 10=47.52%, 20=50.89%, 50=0.73%, 100=0.23%, 250=0.09%
    lat (usec) : 500=0.13%, 750=0.15%, 1000=0.06%
    lat (msec) : 2=0.11%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.28%, sys=8.78%, ctx=326090, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45654KB/s, minb=45654KB/s, maxb=45654KB/s, mint=5615msec, maxt=5615msec
  WRITE: io=255652KB, aggrb=45530KB/s, minb=45530KB/s, maxb=45530KB/s, mint=5615msec, maxt=5615msec

Disk stats (read/write):
  vda: ios=933/399, merge=0/11, ticks=7580/44952, in_queue=52528, util=91.76%
$

=========== Test time: Sat Jun 17 14:28:14 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25746: Sat Jun 17 14:28:21 2017
  read : io=256348KB, bw=45867KB/s, iops=11466, runt=  5589msec
    slat (usec): min=1, max=962, avg= 3.37, stdev= 4.53
    clat (usec): min=6, max=174992, avg=52.14, stdev=1822.67
     lat (usec): min=7, max=174994, avg=55.51, stdev=1822.67
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  510], 99.90th=[ 3376], 99.95th=[15808],
     | 99.99th=[112128]
    bw (KB  /s): min=42557, max=51604, per=100.00%, avg=46897.90, stdev=2730.21
  write: io=255652KB, bw=45742KB/s, iops=11435, runt=  5589msec
    slat (usec): min=1, max=281, avg= 3.43, stdev= 2.67
    clat (usec): min=8, max=108526, avg=24.32, stdev=740.60
     lat (usec): min=10, max=108530, avg=27.76, stdev=740.60
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   11],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   77], 99.90th=[ 1464], 99.95th=[ 2096],
     | 99.99th=[16320]
    bw (KB  /s): min=42422, max=49841, per=100.00%, avg=46665.40, stdev=2465.25
    lat (usec) : 10=49.78%, 20=48.55%, 50=0.75%, 100=0.24%, 250=0.11%
    lat (usec) : 500=0.12%, 750=0.15%, 1000=0.08%
    lat (msec) : 2=0.13%, 4=0.01%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=8.77%, sys=9.26%, ctx=309539, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45866KB/s, minb=45866KB/s, maxb=45866KB/s, mint=5589msec, maxt=5589msec
  WRITE: io=255652KB, aggrb=45741KB/s, minb=45741KB/s, maxb=45741KB/s, mint=5589msec, maxt=5589msec

Disk stats (read/write):
  vda: ios=896/365, merge=0/4, ticks=6952/41144, in_queue=51228, util=91.93%
$

=========== Test time: Sat Jun 17 14:28:25 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25759: Sat Jun 17 14:28:31 2017
  read : io=256348KB, bw=45998KB/s, iops=11499, runt=  5573msec
    slat (usec): min=1, max=268, avg= 3.37, stdev= 2.65
    clat (usec): min=6, max=154155, avg=48.39, stdev=1660.03
     lat (usec): min=7, max=154159, avg=51.76, stdev=1660.07
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[    9], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  490], 99.90th=[ 2288], 99.95th=[16192],
     | 99.99th=[113152]
    bw (KB  /s): min=35176, max=50011, per=99.81%, avg=45911.90, stdev=4316.62
  write: io=255652KB, bw=45873KB/s, iops=11468, runt=  5573msec
    slat (usec): min=1, max=184, avg= 3.47, stdev= 2.17
    clat (usec): min=8, max=119658, avg=27.85, stdev=986.31
     lat (usec): min=10, max=119659, avg=31.32, stdev=986.29
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   44], 99.90th=[ 1512], 99.95th=[ 2160],
     | 99.99th=[47872]
    bw (KB  /s): min=36288, max=48532, per=99.75%, avg=45759.10, stdev=3857.72
    lat (usec) : 10=50.23%, 20=48.12%, 50=0.76%, 100=0.25%, 250=0.09%
    lat (usec) : 500=0.14%, 750=0.14%, 1000=0.07%
    lat (msec) : 2=0.12%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=8.13%, sys=9.92%, ctx=318811, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45998KB/s, minb=45998KB/s, maxb=45998KB/s, mint=5573msec, maxt=5573msec
  WRITE: io=255652KB, aggrb=45873KB/s, minb=45873KB/s, maxb=45873KB/s, mint=5573msec, maxt=5573msec

Disk stats (read/write):
  vda: ios=896/361, merge=0/6, ticks=7008/40344, in_queue=48916, util=91.35%
$

=========== Test time: Sat Jun 17 14:29:01 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25773: Sat Jun 17 14:29:08 2017
  read : io=256348KB, bw=45768KB/s, iops=11442, runt=  5601msec
    slat (usec): min=1, max=215, avg= 3.61, stdev= 2.43
    clat (usec): min=6, max=164270, avg=47.88, stdev=1691.56
     lat (usec): min=8, max=164275, avg=51.49, stdev=1691.60
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    7], 10.00th=[    7], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    9], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   55], 99.50th=[  366], 99.90th=[ 2672], 99.95th=[13760],
     | 99.99th=[110080]
    bw (KB  /s): min=39053, max=50011, per=100.00%, avg=46319.30, stdev=3583.31
  write: io=255652KB, bw=45644KB/s, iops=11410, runt=  5601msec
    slat (usec): min=1, max=1596, avg= 3.72, stdev= 6.72
    clat (usec): min=8, max=119512, avg=28.07, stdev=974.61
     lat (usec): min=10, max=119514, avg=31.79, stdev=974.63
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[   10], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   12], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   22], 99.50th=[   33], 99.90th=[ 1576], 99.95th=[ 2576],
     | 99.99th=[45312]
    bw (KB  /s): min=38929, max=48936, per=100.00%, avg=46086.30, stdev=3389.85
    lat (usec) : 10=43.18%, 20=55.16%, 50=0.81%, 100=0.25%, 250=0.10%
    lat (usec) : 500=0.14%, 750=0.12%, 1000=0.06%
    lat (msec) : 2=0.10%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.94%, sys=8.81%, ctx=331305, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45768KB/s, minb=45768KB/s, maxb=45768KB/s, mint=5601msec, maxt=5601msec
  WRITE: io=255652KB, aggrb=45643KB/s, minb=45643KB/s, maxb=45643KB/s, mint=5601msec, maxt=5601msec

Disk stats (read/write):
  vda: ios=896/359, merge=0/5, ticks=6916/40324, in_queue=48032, util=90.91%
$

=========== Test time: Sat Jun 17 14:30:52 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25790: Sat Jun 17 14:30:59 2017
  read : io=256348KB, bw=45148KB/s, iops=11286, runt=  5678msec
    slat (usec): min=1, max=204, avg= 3.43, stdev= 2.59
    clat (usec): min=6, max=124274, avg=48.66, stdev=1586.47
     lat (usec): min=7, max=124278, avg=52.09, stdev=1586.48
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  470], 99.90th=[ 4192], 99.95th=[16320],
     | 99.99th=[101888]
    bw (KB  /s): min=41399, max=50108, per=100.00%, avg=45606.30, stdev=2974.33
  write: io=255652KB, bw=45025KB/s, iops=11256, runt=  5678msec
    slat (usec): min=1, max=188, avg= 3.51, stdev= 1.94
    clat (usec): min=8, max=161861, avg=29.07, stdev=1092.49
     lat (usec): min=10, max=161865, avg=32.58, stdev=1092.50
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   41], 99.90th=[ 1528], 99.95th=[ 2096],
     | 99.99th=[47872]
    bw (KB  /s): min=41921, max=48858, per=100.00%, avg=45414.70, stdev=2546.24
    lat (usec) : 10=47.58%, 20=50.73%, 50=0.81%, 100=0.23%, 250=0.09%
    lat (usec) : 500=0.14%, 750=0.13%, 1000=0.07%
    lat (msec) : 2=0.12%, 4=0.02%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=8.91%, sys=8.98%, ctx=321491, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=45147KB/s, minb=45147KB/s, maxb=45147KB/s, mint=5678msec, maxt=5678msec
  WRITE: io=255652KB, aggrb=45025KB/s, minb=45025KB/s, maxb=45025KB/s, mint=5678msec, maxt=5678msec

Disk stats (read/write):
  vda: ios=916/388, merge=0/6, ticks=7504/45384, in_queue=52888, util=91.41%
$

=========== Test time: Sat Jun 17 14:31:03 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25803: Sat Jun 17 14:31:10 2017
  read : io=256348KB, bw=46097KB/s, iops=11524, runt=  5561msec
    slat (usec): min=1, max=197, avg= 3.39, stdev= 2.31
    clat (usec): min=6, max=123689, avg=48.57, stdev=1631.93
     lat (usec): min=7, max=123691, avg=51.96, stdev=1631.97
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[    9], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[  490], 99.90th=[ 2352], 99.95th=[16192],
     | 99.99th=[110080]
    bw (KB  /s): min=42557, max=51596, per=100.00%, avg=46632.00, stdev=2977.54
  write: io=255652KB, bw=45972KB/s, iops=11493, runt=  5561msec
    slat (usec): min=1, max=194, avg= 3.48, stdev= 2.46
    clat (usec): min=8, max=167859, avg=27.42, stdev=1001.04
     lat (usec): min=10, max=167861, avg=30.90, stdev=1001.03
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   46], 99.90th=[ 1640], 99.95th=[ 2512],
     | 99.99th=[30336]
    bw (KB  /s): min=42422, max=49688, per=100.00%, avg=46404.10, stdev=2702.73
    lat (usec) : 10=49.47%, 20=48.87%, 50=0.76%, 100=0.23%, 250=0.10%
    lat (usec) : 500=0.15%, 750=0.14%, 1000=0.07%
    lat (msec) : 2=0.12%, 4=0.01%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.88%, sys=8.24%, ctx=319108, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=46097KB/s, minb=46097KB/s, maxb=46097KB/s, mint=5561msec, maxt=5561msec
  WRITE: io=255652KB, aggrb=45972KB/s, minb=45972KB/s, maxb=45972KB/s, mint=5561msec, maxt=5561msec

Disk stats (read/write):
  vda: ios=896/354, merge=0/4, ticks=6988/39316, in_queue=48628, util=91.05%
$

=========== Test time: Sat Jun 17 14:31:13 UTC 2017 ==============
trivial-readwrite-1g: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=posixaio, iodepth=1
fio-2.2.10
Starting 1 thread

trivial-readwrite-1g: (groupid=0, jobs=1): err= 0: pid=25816: Sat Jun 17 14:31:20 2017
  read : io=256348KB, bw=44675KB/s, iops=11168, runt=  5738msec
    slat (usec): min=1, max=200, avg= 3.28, stdev= 2.60
    clat (usec): min=6, max=132951, avg=46.85, stdev=1536.36
     lat (usec): min=7, max=132955, avg=50.13, stdev=1536.56
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[    9], 95.00th=[   10],
     | 99.00th=[   57], 99.50th=[  524], 99.90th=[ 3152], 99.95th=[16512],
     | 99.99th=[94720]
    bw (KB  /s): min=33208, max=54656, per=99.47%, avg=44436.64, stdev=6247.71
  write: io=255652KB, bw=44554KB/s, iops=11138, runt=  5738msec
    slat (usec): min=1, max=181, avg= 3.40, stdev= 2.82
    clat (usec): min=8, max=114478, avg=32.14, stdev=1097.66
     lat (usec): min=10, max=114479, avg=35.54, stdev=1097.65
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   11],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   24], 99.50th=[   54], 99.90th=[ 1768], 99.95th=[ 4080],
     | 99.99th=[52480]
    bw (KB  /s): min=32968, max=54632, per=99.37%, avg=44273.36, stdev=6358.38
    lat (usec) : 10=52.38%, 20=45.94%, 50=0.76%, 100=0.23%, 250=0.09%
    lat (usec) : 500=0.14%, 750=0.14%, 1000=0.09%
    lat (msec) : 2=0.13%, 4=0.01%, 10=0.02%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=9.29%, sys=8.04%, ctx=306818, majf=1, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=64087/w=63913/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=256348KB, aggrb=44675KB/s, minb=44675KB/s, maxb=44675KB/s, mint=5738msec, maxt=5738msec
  WRITE: io=255652KB, aggrb=44554KB/s, minb=44554KB/s, maxb=44554KB/s, mint=5738msec, maxt=5738msec

Disk stats (read/write):
  vda: ios=899/389, merge=0/4, ticks=7268/42760, in_queue=51496, util=92.87%
$